app/Models/GtpModel.php

    public function get_desa_wisata()
    {
        $coords = "ST_Y(ST_Centroid({$this->table}.geom)) AS lat, ST_X(ST_Centroid({$this->table}.geom)) AS lng";
        $query = $this->db->table($this->table)
            ->select("id, name, {$coords}")
            ->get();
---
SELECT `id`, `name`, ST_Y(ST_Centroid(gtp.geom)) AS lat, ST_X(ST_Centroid(gtp.geom)) AS lng
FROM `gtp`

    public function get_geoJson($id = null)
    {
        $geoJson = "ST_AsGeoJSON({$this->table}.geom) AS geoJson";
        $query = $this->db->table($this->table)
            ->select("{$geoJson}")
            ->where('id', $id)
            ->get();
---
SELECT ST_AsGeoJSON(gtp.geom) AS geoJson
FROM `gtp`
WHERE `id` = 'GTP01'